import json

tabel_data_mapping = {
    "血常规": [
        "血红蛋白",
        "红细胞计数",
        "红细胞压积",
        "平均红细胞体积",
        "平均红细胞血红蛋白量",
        "平均红细胞血红蛋白浓度",
        "红细胞分布宽度",
        "白细胞计数",
        "中心粒细胞绝对值",
        "淋巴细胞绝对值",
        "单核细胞绝对值",
        "嗜酸性粒细胞绝对值",
        "嗜碱性粒细胞绝对值",
        "中心粒细胞百分比",
        "淋巴细胞百分比",
        "单核细胞百分比",
        "嗜酸性粒细胞百分比",
        "嗜碱性粒细胞百分比",
        "血小板计数",
        "血小板压积",
        "血小板平均体积",
        "血小板分布宽度",
        "C-反应蛋白",
    ],
    "血生化": [
        "总蛋白",
        "白蛋白",
        "球蛋白",
        "白蛋白/球蛋白比值",
        "总胆红素",
        "直接胆红素",
        "间接胆红素",
        "丙氨酸氨基转移酶",
        "天冬氨酸氨基转移酶",
        "AST线粒体同工酶",
        "AST/ALT",
        "γ-谷氨酰转肽酶",
        "碱性磷酸酶",
        "总胆汁酸",
        "前白蛋白",
        "总胆固醇",
        "甘油三酯",
        "高密度脂蛋白胆固醇",
        "低密度脂蛋白胆固醇",
        "肌酐",
        "肾小球滤过率",
        "尿素",
        "尿素：肌酐",
        "尿酸",
        "钾",
        "钠",
        "氯",
    ],
    "凝血功能": [
        "血浆凝血酶原时间",
        "血浆凝血酶原时间活动度",
        "国际标准化比率",
        "活化部分凝血活酶时间",
        "纤维蛋白原含量",
        "血浆凝血酶时间测定",
        "抗凝血酶-III",
        "D二聚体",
        "纤维蛋白（原）降解产物",
    ],
    "肿瘤标志物": [
        "甲胎蛋白",
        "铁蛋白",
        "癌胚抗原",
        "糖类抗原199",
        "糖类抗原125",
        "糖类抗原153",
        "鳞状细胞癌抗原",
        "细胞角蛋白19片段",
        "糖类抗原CA-50",
        "非小细胞肺癌原CY211",
        "人附睾蛋白4",
        "绝经后ROMA值",
        "绝经前ROMA值",
        "糖类抗原724",
        "糖类抗原242",
        "神经元特异性烯醇化酶",
    ],
    "甲状腺功能": [
        "四碘甲状腺原氨酸",
        "三碘甲状原氨酸",
        "促甲状腺素",
        "游离甲状腺素",
        "游离三碘甲状腺原氨酸",
        "甲状腺过氧化物酶抗体",
        "甲状腺球蛋白抗体",
        "甲状旁腺素",
        "β-胶原特殊序列",
        "骨钙素N端中分子片段",
        "降钙素",
        "甲状腺球蛋白TG",
        "促甲状腺素受体抗体",
    ],
}


def convert_da_data():
    data = json.load(open("data/clean_ocr_ppt_da_v3.json"))
    for item in data:
        report_title = item["report_title"]
        if report_title in tabel_data_mapping:
            new_key = f"{report_title}检验数据"
            item[new_key] = ""
            for field in tabel_data_mapping[report_title]:
                if field in item:
                    item[new_key] += f"{field} {item[field]}"
                    item.pop(field)
        else:
            print(report_title)
    json.dump(data, open("data/clean_ocr_ppt_da_v3_1.json", "w"), ensure_ascii=False,indent=4)

    return


if __name__ == "__main__":
    convert_da_data()
